# Task 4.9 Part 1

## 01. Import libraries

In [1]:
# import libraries
import pandas as pd
import numpy as np
import os

In [2]:
# create path shortcut
path = r'/Users/mindydong/Documents/School/Data Analyst/Achievement 4/04-2023 Instacart Basket Analysis'

In [3]:
#import customer.csv
df_cust = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'), index_col = False)

## 02. Data wrangling

In [4]:
#explore data
df_cust.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [5]:
df_cust.shape

(206209, 10)

### Renaming columns

In [6]:
#rename STATE to state for consistency
df_cust.rename(columns = {'STATE' : 'state'}, inplace = True)

In [7]:
#rename Gender to gender for consistency
df_cust.rename(columns = {'Gender' : 'gender'}, inplace = True)

In [8]:
#rename Age to age for consistency
df_cust.rename(columns = {'Age' : 'age'}, inplace = True)

In [9]:
#rename fam_status to marital_status
df_cust.rename(columns = {'fam_status' : 'marital_status'}, inplace = True)

In [10]:
#rename n_dependants to n_dependents
df_cust.rename(columns = {'n_dependants' : 'number_dependents'}, inplace = True)

In [11]:
#check output
df_cust.head()

,user_id,First Name,Surnam,gender,state,age,date_joined,number_dependents,marital_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

## 03. Consistency check

### Check for missing values

In [12]:
#check for missing values in df_cust
df_cust.isnull().sum()

user_id                  0
First Name           11259
Surnam                   0
gender                   0
state                    0
age                      0
date_joined              0
number_dependents        0
marital_status           0
income                   0
dtype: int64

In [13]:
# remove first_name and last_name columns

df_cust= df_cust.drop(columns = ['First Name', 'Surnam'])

### Check for duplicates

In [14]:
# find duplicates in df_cust
df_dups = df_cust [df_cust.duplicated()]

In [15]:
df_dups

Empty DataFrame
Columns: [user_id, gender, state, age, date_joined, number_dependents, marital_status, income]
Index: []

No duplicates found

### Check for mixed-type data

In [16]:
for col in df_cust.columns.tolist():
  weird = (df_cust[[col]].applymap(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_cust[weird]) > 0:
    print (col)

In [17]:
#change data type for user_id
df_cust['user_id'] = df_cust['user_id'].astype('str')

In [18]:
#check output
df_cust.head()

,user_id,gender,state,age,date_joined,number_dependents,marital_status,income
0,26711,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Female,Maryland,26,1/1/2017,1,married,40374

In [19]:
#export cleaned data
df_cust.to_csv(os.path.join(path,'02 Data', 'Prepared Data', 'customer_checked.csv'))

## 04. Merge customer data with orders and products data

### Import order and product data

In [21]:
#import ords_prods_merged_2.pkl
ords_prods = pd.read_pickle(os.path.join(path,'02 Data', 'Prepared Data', 'ords_prods_merged_2.pkl'))

### Prepare for merge

In [22]:
#check out of ords_prods
ords_prods.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_last_order,product_id,add_to_cart_order,reordered,product_name,...,prices,busiest_day,busiest_days,busiest_period_of_day,max_order,loyalty_flag,avg_spend,spender_flag,order_frequency,order_frequency_flag
0,2539329,1,1,2,8,NaN,196,1,0,Soda,...,9.0,Regularly busy,Regularly busy,Average orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
1,2398795,1,2,3,7,15.0,196,1,1,Soda,...,9.0,Regularly busy,Least busy days,Average orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
2,473747,1,3,3,12,21.0,196,1,1,Soda,...,9.0,Regularly busy,Least busy days,Most orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
3,2254736,1,4,4,7,29.0,196,1,1,Soda,...,9.0,Least busy,Least busy days,Average orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
4,431534,1,5,4,15,28.0,196,1,1,Soda,...,9.0,Least busy,Least busy days,Most orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer

In [23]:
#check shape of ords_prods_merge
ords_prods.shape

(32434212, 22)

In [26]:
#check shape of df_cust
df_cust.shape

(206209, 8)

### Merge ords_prods with df_cust

In [24]:
#change data type of user_id in ords_prods
ords_prods ['user_id'] = ords_prods['user_id'].astype('str')

In [25]:
#merge ords_prods with df_cust
df_merged = ords_prods.merge(df_cust, on = 'user_id', how = 'left')

In [27]:
df_merged.shape

(32434212, 29)

In [28]:
#check merge output
df_merged.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_last_order,product_id,add_to_cart_order,reordered,product_name,...,spender_flag,order_frequency,order_frequency_flag,gender,state,age,date_joined,number_dependents,marital_status,income
0,2539329,1,1,2,8,NaN,196,1,0,Soda,...,Low spender,20.5,Non-frequent customer,Female,Alabama,31,2/17/2019,3,married,40423
1,2398795,1,2,3,7,15.0,196,1,1,Soda,...,Low spender,20.5,Non-frequent customer,Female,Alabama,31,2/17/2019,3,married,40423
2,473747,1,3,3,12,21.0,196,1,1,Soda,...,Low spender,20.5,Non-frequent customer,Female,Alabama,31,2/17/2019,3,married,40423
3,2254736,1,4,4,7,29.0,196,1,1,Soda,...,Low spender,20.5,Non-frequent customer,Female,Alabama,31,2/17/2019,3,married,40423
4,431534,1,5,4,15,28.0,196,1,1,Soda,...,Low spender,20.5,Non-frequent customer,Female,Alabama,31,2/17/2019,3,married,40423

In [ ]:
# Export df_merged to pickle
df_merged.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'orders_products_customers.pkl'))